> I would also like this enhancement very much, but I think I would keep the keyword dynamic. After all, a conditional statement is dynamic. Maybe something like so :
> 
> ```
> dynamic "lambda_function_association" {
>   if = var.lambda_edge_enabled
> 
>   content {
>      # ...
>   }
> }
> ```
> 
> At work, we currently do something similar to the example you presented in many modules. Here a short example :
> 
> ```
> locals {
>   if_logging_enabled = var.logging_enabled ? [{}] : []
>   if_cors_enabled = var.cors_enabled ? [{}] : []
> }
> 
> resource "aws_s3_bucket" "bucket" {
>   # ...
>   dynamic "logging" {
>     for_each = local.if_logging_enabled
> 
>     content {
>        # ...
>     }
>   }
> 
>   dynamic "cors_rule" {
>     for_each = local.if_cors_enabled 
> 
>     content {
>        # ...
>     }
>   }
> }
> ```

hey there, how do you get logging to work dynamically? I always end up with a logging object, that has required fields, when applying this ends up badly.

Example of plan

```terraform
  # module.s3_bucket.aws_s3_bucket.default[0] will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "eu-central-1-s3-fiercely-test-example"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {}

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }
```

Results in 

```terraform
Error: Error putting S3 logging: InvalidTargetBucketForLogging: The target bucket for logging does not exist
        status code: 400, request id: REDACTED, host id: REDACTED

  on ..\..\main.tf line 1, in resource "aws_s3_bucket" "default":
   1: resource "aws_s3_bucket" "default" {


```